<?php

return [
    'root' => 'Корень',

    /*
    |--------------------------------------------------------------------------
    | Кнопки
    |--------------------------------------------------------------------------
    */
    'button.save'         => 'Сохранить',
    'button.expand_all'   => 'Развернуть все',
    'button.collapse_all' => 'Свернуть все',

    /*
    |--------------------------------------------------------------------------
    | Форма
    |--------------------------------------------------------------------------
    */
    'components.tree.buttons.select_all.label'   => 'Выбрать все',
    'components.tree.buttons.deselect_all.label' => 'Снять выделение',
    'components.tree.buttons.expand_all.label'   => 'Развернуть все',
    'components.tree.buttons.collapse_all.label' => 'Свернуть все',

    /*
    |--------------------------------------------------------------------------
    | Сообщения
    |--------------------------------------------------------------------------
    */
    'actions.delete.confirmation.with_children' => 'Вы уверены, что хотите удалить эту запись и все её дочерние элементы?',
];
